app/controllers/acessos_controller.rb

  def index
    @acessos = Acesso.all
---
SELECT "acessos".* FROM "acessos"

  def create
    @acesso = Acesso.new(acesso_params)

    if @acesso.save
---
INSERT INTO "acessos" ("key", "url", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["key", "1234"], ["url", "www.teste.com1234"], ["date", "2017-10-01234"], ["created_at", "2017-10-03 02:43:54.277116"], ["updated_at", "2017-10-03 02:43:54.277116"]]

  def update
    if @acesso.update(acesso_params)
---
UPDATE "acessos" SET "key" = ?, "url" = ?, "date" = ?, "updated_at" = ? WHERE "acessos"."id" = ?  [["key", "1234555"], ["url", "www.teste.com1234555"], ["date", "2017-10-01234555"], ["updated_at", "2017-10-03 03:59:57.636830"], ["id", 8]]

  def destroy
    @acesso.destroy
---
DELETE FROM "acessos" WHERE "acessos"."id" = ?  [["id", 1]]

    def set_acesso
      @acesso = Acesso.find(params[:id])
---
SELECT  "acessos".* FROM "acessos" WHERE "acessos"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]